[
  {
    "_id": 1,
    "img_name": "images/giants_cowboys.jpg",
    "teamA": "Giants",
    "teamB": "Cowboys",
    "date": "2025-09-15",
    "location": "MetLife Stadium",
    "score": "21-17",
    "game_summary": "In a tightly contested NFL matchup, the Giants edged out the Cowboys in the final minutes.",
    "play_by_play": "The game started with both teams trading field goals, but the Giants broke the deadlock with a long touchdown drive in the first quarter. The Cowboys responded in the second quarter with a balanced attack, scoring on a quick strike. In the third quarter, defensive stands and a critical turnover set up the Giants for another scoring drive. With the score tied late in the fourth quarter, a disciplined drive culminated in a go-ahead touchdown with just under two minutes remaining, allowing the Giants to secure a hard-fought victory.",
    "match_stats": {
      "total_yards": "350-320",
      "turnovers": "1-2",
      "penalty_yards": "45-55",
      "time_of_possession": "30:15-29:45"
    }
  },
  {
    "_id": 2,
    "img_name": "lions.jpeg",
    "teamA": "Lions",
    "teamB": "Falcons",
    "date": "2025-10-05",
    "location": "Ford Field",
    "score": "24-21",
    "game_summary": "In a nail-biting NFL battle at Ford Field, the Lions managed a narrow victory over the Falcons.",
    "play_by_play": "The Lions started with a methodical drive that resulted in an early touchdown, establishing a modest lead in the first quarter. The Falcons countered in the second quarter with an explosive run that brought the game to a tie. After a defensive stalemate in the third quarter, momentum shifted in the fourth when a critical interception by the Lions set up a game-winning field goal. The final minute was a tense exchange of punts and short drives, but the Lions held on to clinch the win.",
    "match_stats": {
      "total_yards": "310-305",
      "turnovers": "1-1",
      "penalty_yards": "40-50",
      "time_of_possession": "29:30-30:30"
    }
  },
  {
    "_id": 3,
    "img_name": "warriors.jpeg",
    "teamA": "Warriors",
    "teamB": "Lakers",
    "date": "2025-03-14",
    "location": "Chase Center",
    "score": "120-115",
    "game_summary": "In an electrifying NBA showdown, the Warriors narrowly defeated the Lakers in a high-scoring battle.",
    "play_by_play": "The game was a back-and-forth affair from tip-off. The Warriors surged ahead in the first quarter with their trademark three-point shooting, but the Lakers quickly closed the gap with fast-break points. In the second quarter, both teams traded baskets while defensive adjustments kept the lead razor-thin. The third quarter saw a flurry of steals and fast-break dunks, with the Warriors pulling slightly ahead. In the final period, clutch shooting and strategic timeouts culminated in a dramatic finish—a decisive three-pointer by the Warriors with less than 10 seconds left sealed the victory.",
    "match_stats": {
      "FG%": "48%-45%",
      "rebounds": "42-38",
      "assists": "25-23",
      "turnovers": "12-15"
    }
  },
  {
    "_id": 4,
    "img_name": "sharks.png",
    "teamA": "Sharks",
    "teamB": "Predators",
    "date": "2025-03-15",
    "location": "SAP Center at San Jose",
    "score": "3-2 OT",
    "game_summary": "In a thrilling NHL overtime battle, the Sharks edged out the Predators in a game full of momentum swings.",
    "play_by_play": "The first period was a showcase of aggressive forechecking, with both teams exchanging rapid shots on goal. The Sharks took a 2-0 lead in the second period, capitalizing on a power play, but the Predators managed to tie the game late in the period. In the third period, the intensity increased as both teams fought hard on the penalty kill, and neither side could secure the winning goal in regulation. The overtime period was a sudden-death scenario, where a breakaway by the Sharks resulted in a spectacular goal, clinching the victory.",
    "match_stats": {
      "shots_on_goal": "35-32",
      "penalty_minutes": "8-10",
      "hits": "12-9",
      "power_play_percentage": "25%-20%"
    }
  },
  {
    "_id": 5,
    "img_name": "real_barca.jpeg",
    "teamA": "Real Madrid",
    "teamB": "Barcelona",
    "date": "2025-04-20",
    "location": "Santiago Bernabéu Stadium",
    "score": "2-2",
    "game_summary": "In one of the fiercest El Clásico matches, Real Madrid and Barcelona battled to a dramatic 2-2 draw.",
    "play_by_play": "From the opening whistle, both teams pressed relentlessly. Real Madrid drew first blood with a swift counterattack that led to an early goal. Barcelona responded with an intricately worked set-piece that equalized before halftime. The second half saw tactical battles and physical challenges as midfielders dueled for control. A controversial penalty in the 75th minute gave Real Madrid a brief lead, only for Barcelona to snatch an equalizer in the dying moments of stoppage time, leaving the stadium in a mix of jubilation and disbelief.",
    "match_stats": {
      "possession": "55%-45%",
      "shots_on_target": "6-5",
      "fouls": "14-12",
      "corners": "7-4"
    }
  },
  {
    "_id": 6,
    "img_name": "mancity_liverpool.jpeg",
    "teamA": "Manchester City",
    "teamB": "Liverpool",
    "date": "2025-05-02",
    "location": "Etihad Stadium",
    "score": "3-2",
    "game_summary": "A nail-biting Premier League clash saw Manchester City edge past Liverpool in a game filled with twists and tactical brilliance.",
    "play_by_play": "City began the match with relentless pressure, scoring early through a rapid-fire break. Liverpool quickly countered with an equally impressive drive, leveling the score before halftime. The second half was a showcase of midfield artistry and defensive adjustments, with both sides trading goals. In the final 10 minutes, a perfectly executed set-piece gave City a slight edge, and despite a late surge from Liverpool, City held on to secure the victory in a match that had fans on the edge of their seats until the final buzzer.",
    "match_stats": {
      "possession": "60%-40%",
      "shots_on_target": "10-8",
      "fouls": "12-15",
      "corner_kicks": "6-5"
    }
  },
  {
    "_id": 7,
    "img_name": "raptors_celtics.jpeg",
    "teamA": "Toronto Raptors",
    "teamB": "Boston Celtics",
    "date": "2025-03-22",
    "location": "Scotiabank Arena",
    "score": "110-105",
    "game_summary": "In a thrilling NBA contest, the Toronto Raptors edged out the Boston Celtics in a fast-paced, high-scoring battle.",
    "play_by_play": "The game featured non-stop action from the opening tip-off, with both teams exchanging three-pointers and driving to the hoop. The Raptors built a slim lead in the first half, but the Celtics fought back fiercely in the third quarter, trimming the deficit to just a few points. In the final quarter, key defensive stops and clutch shooting from downtown allowed the Raptors to maintain a narrow lead. With the clock winding down, every possession was critical, and the Raptors' final play secured a hard-fought victory.",
    "match_stats": {
      "FG%": "47%-44%",
      "rebounds": "38-36",
      "assists": "24-21",
      "turnovers": "11-13"
    }
  },
  {
    "_id": 8,
    "img_name": "giants_dodgers.jpeg",
    "teamA": "Dodgers",
    "teamB": "Giants",
    "date": "2025-06-10",
    "location": "Dodger Stadium",
    "score": "5-3",
    "game_summary": "In a classic MLB rivalry game, the Dodgers triumphed over the Giants in a pitcher's duel.",
    "play_by_play": "The early innings were a showcase of brilliant pitching as both teams kept the scoring to a minimum. The Dodgers broke the deadlock in the middle innings with timely hits and aggressive baserunning, while the Giants managed to claw back a run. As the game progressed into the later innings, the Dodgers' bullpen held strong despite a late rally by the Giants. A critical strikeout in the final inning sealed the victory for the Dodgers in a game that was a true test of nerves.",
    "match_stats": {
      "innings": "9",
      "strikeouts": "12-10",
      "earned_run_average": "2.85-3.20",
      "hits": "8-9"
    }
  },
  {
    "_id": 9,
    "img_name": "eagles.jpeg",
    "teamA": "Eagles",
    "teamB": "Chiefs",
    "date": "2025-03-20",
    "location": "Lincoln Financial Field",
    "score": "28-31",
    "game_summary": "In a high-stakes NFL showdown, the Eagles narrowly fell to the Chiefs in a game marked by explosive plays and last-minute heroics.",
    "play_by_play": "The game opened with a spectacular long touchdown pass from the Eagles, giving them an early lead. The Chiefs quickly responded with a balanced offensive attack, tying the score before halftime. In the third quarter, both teams exchanged scoring drives amid fierce defensive stands. The fourth quarter turned into a roller coaster of momentum shifts—key interceptions, critical penalties, and a series of big plays defined the period. In the dying minutes, a decisive field goal attempt by the Chiefs broke the deadlock, and despite a late surge from the Eagles, the Chiefs held on for the win.",
    "match_stats": {
      "total_yards": "380-405",
      "turnovers": "1-2",
      "penalty_yards": "50-65",
      "time_of_possession": "30:00-30:00"
    }
  }
]
